Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_otg2_hs_device.h
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT             (0x3U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_0           (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT              (0x1U<<19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ              (0x7FU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL1 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_EPENA                (0x1U<<31)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_EPDIS                (0x1U<<30)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM              (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_SNAK                 (0x1U<<27)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_CNAK                 (0x1U<<26)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_STALL                (0x1U<<21)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_SNPM                 (0x1U<<20)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP                (0x3U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP_0              (0x1U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_NAKSTS               (0x1U<<17)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_EONUM_DPID           (0x1U<<16)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_USBAEP               (0x1U<<15)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ                (0x7FFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT1 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPINT1_NYET                 (0x1U<<14)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT1_B2BSTUP              (0x1U<<6)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT1_OTEPDIS              (0x1U<<4)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT1_STUP                 (0x1U<<3)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT1_EPDISD               (0x1U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT1_XFRC                 (0x1U<<0)

// OTG_HS_DOEPTSIZ1 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT      (0x3U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT              (0x3FFU<<19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT_0            (0x1U<<19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ              (0x7FFFFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL2 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA                (0x1U<<31)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS                (0x1U<<30)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM              (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK                 (0x1U<<27)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK                 (0x1U<<26)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_STALL                (0x1U<<21)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM                 (0x1U<<20)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP                (0x3U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP_0              (0x1U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS               (0x1U<<17)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID           (0x1U<<16)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP               (0x1U<<15)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ                (0x7FFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT2 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPINT2_NYET                 (0x1U<<14)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP              (0x1U<<6)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS              (0x1U<<4)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT2_STUP                 (0x1U<<3)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD               (0x1U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT2_XFRC                 (0x1U<<0)

// OTG_HS_DOEPTSIZ2 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT      (0x3U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT              (0x3FFU<<19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT_0            (0x1U<<19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ              (0x7FFFFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL3 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA                (0x1U<<31)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS                (0x1U<<30)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM              (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK                 (0x1U<<27)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK                 (0x1U<<26)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_STALL                (0x1U<<21)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM                 (0x1U<<20)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP                (0x3U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP_0              (0x1U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS               (0x1U<<17)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID           (0x1U<<16)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP               (0x1U<<15)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ                (0x7FFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT3 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_NYET                 (0x1U<<14)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP              (0x1U<<6)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS              (0x1U<<4)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_STUP                 (0x1U<<3)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD               (0x1U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT3_XFRC                 (0x1U<<0)

// OTG_HS_DOEPTSIZ3 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT      (0x3U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT              (0x3FFU<<19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_0            (0x1U<<19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ              (0x7FFFFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL4 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA                (0x1U<<31)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS                (0x1U<<30)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM              (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK                 (0x1U<<27)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK                 (0x1U<<26)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_STALL                (0x1U<<21)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM                 (0x1U<<20)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP                (0x3U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP_0              (0x1U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_NAKSTS               (0x1U<<17)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_EONUM_DPID           (0x1U<<16)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_USBAEP               (0x1U<<15)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ                (0x7FFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT4 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_NYET                 (0x1U<<14)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP              (0x1U<<6)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS              (0x1U<<4)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_STUP                 (0x1U<<3)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD               (0x1U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DOEPINT4_XFRC                 (0x1U<<0)

// OTG_HS_DOEPTSIZ4 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT      (0x3U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT              (0x3FFU<<19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT_0            (0x1U<<19)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ              (0x7FFFFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL5 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_EPENA                (0x1U<<31)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_EPDIS                (0x1U<<30)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_SODDFRM              (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_SNAK                 (0x1U<<27)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_CNAK                 (0x1U<<26)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_STALL                (0x1U<<21)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_SNPM                 (0x1U<<20)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP                (0x3U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP_0              (0x1U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_NAKSTS               (0x1U<<17)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_EONUM_DPID           (0x1U<<16)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_USBAEP               (0x1U<<15)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ                (0x7FFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT5 Configuration

